app/views/users/user_page.html.erb

SELECT "tweets".* FROM "tweets" WHERE ("tweets".user_id = 1)
---
    <b>Tweets:</b>
    <%= @user.tweets.count %>