app/controllers/followsusers_controller.rb

SELECT "followsusers".* FROM "followsusers"
---
  def index
    @followsusers = Followsuser.all

SELECT "followsusers".* FROM "followsusers" WHERE ("followsusers"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def show
    @followsuser = Followsuser.find(params[:id])

SELECT "followsusers".* FROM "followsusers" WHERE ("followsusers"."id" = 1) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def edit
    @followsuser = Followsuser.find(params[:id])

INSERT INTO "followsusers" ("follower_id", "following_id", "approved", "created_at", "updated_at") VALUES (1, 2, 1, '2011-04-07 21:18:47.018640', '2011-04-07 21:18:47.018640')
---
  def create
    @followsuser = Followsuser.new(params[:followsuser])

    respond_to do |format|
      if @followsuser.save

SELECT "followsusers".* FROM "followsusers" WHERE ("followsusers"."id" = 1) LIMIT 1
UPDATE "followsusers" SET "follower_id" = 2, "updated_at" = '2011-04-07 21:51:04.859419' WHERE ("followsusers"."id" = 1)
---
  def update
    @followsuser = Followsuser.find(params[:id])

    respond_to do |format|
      if @followsuser.update_attributes(params[:followsuser])

SELECT "followsusers".* FROM "followsusers" WHERE ("followsusers"."id" = 2) LIMIT 1
DELETE FROM "followsusers" WHERE ("followsusers"."id" = 2)
---
  def destroy
    @followsuser = Followsuser.find(params[:id])
    @followsuser.destroy