app/controllers/mentions_controller.rb

SELECT "mentions".* FROM "mentions"
---
  def index
    @mentions = Mention.all

SELECT "mentions".* FROM "mentions" WHERE ("mentions"."id" = 1) LIMIT 1
---
  def show
    @mention = Mention.find(params[:id])

INSERT INTO "mentions" ("user_id", "tweet_id", "created_at", "updated_at") VALUES (2, 1, '2011-04-08 01:57:02.094462', '2011-04-08 01:57:02.094462')
---
  def create
    @mention = Mention.new(params[:mention])

    respond_to do |format|
      if @mention.save

SELECT "mentions".* FROM "mentions" WHERE ("mentions"."id" = 3) LIMIT 1
DELETE FROM "mentions" WHERE ("mentions"."id" = 3)
---
  def destroy
    @mention = Mention.find(params[:id])
    @mention.destroy