app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE ("tweets"."id" = 1) LIMIT 1
---
  def show
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("user_id", "body", "created_at", "updated_at") VALUES (NULL, 'hahahaha', '2011-03-22 06:07:28.866451', '2011-03-22 06:07:28.866451')
---
  def create
    @tweet = Tweet.new(params[:tweet])
    @tweet.user_id = current_user.id

    respond_to do |format|
      if @tweet.save