app/controllers/users_controller.rb

  def show
    @user = User.find_by_username(params[:id])
    if @user.nil?
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."username" = 'tits') LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def user_page
    if current_user.nil?
        redirect_to login_url()
    else
      @tweet = Tweet.new
      @user = User.find_by_username(params[:username])
---
SELECT "users".* FROM "users" WHERE ("users"."username" = 'test') LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "firstname", "lastname", "email", "privacy", "webpage", "time_zone", "bio", "location", "language", "created_at", "updated_at", "password") VALUES ('newuser', 'hars', 'mar', 's@s.com', 0, '', 'Eastern Time (US & Canada)', '', '', '', '2011-03-31 21:39:34.431435', '2011-03-31 21:39:34.431435', 'blah')